src/InformationRegisters/СообщенияВТехническуюПоддержку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СообщенияВТехническуюПоддержку</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСообщенийВТехническуюПоддержку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязанноеСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Согласовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отклонено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИсполнителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Файлы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объекты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарии</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Comment>Новое, Отклонено при согласовании, Отправлено, Отклонено разработчиком, Принято, Выполнено</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСообщенийВТехническуюПоддержку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРазработчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРазработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусРазработчика</Name>
					<Comment>Получено, Отклонено, В работе, Установлено в программу, Оказана консультация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРелиза</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаРазработку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскийПриоритетСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектныйПриоритетСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтверждено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтвержденоКем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтвержденоКогда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИсторияИзмененияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзмененияОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РелизКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолноеИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыСообщенийВТехническуюПоддержку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыСообщенийВТехническуюПоддержку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Консультация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ОбщегоНазначенияАСУСО/Ext/Module.bsl
//Прямая запись в регистр данных, измененных с последней загрузки
Процедура ЗагрузкаИзмененныхДанныхАСУСО() Экспорт
	
	ЗагрузкаДанныхАСУСО(Истина);
	
КонецПроцедуры

Процедура ЗагрузкаВсехДанныхАСУСО() Экспорт
	
	ЗагрузкаДанныхАСУСО(Ложь);
	
КонецПроцедуры

Процедура ЗагрузкаДанныхАСУСО(ТолькоИзмененные)
	
	РегистрыСведений.СообщенияВТехническуюПоддержку.ОтправитьНедоставленныеСообщения();
	
	ТекстЖурналаПриПодключении = ?(ТолькоИзмененные, "Подключение к веб-сервису AsusoExchange для получения изменившихся данных", 
														"Подключение к веб-сервису AsusoExchange для получения данных");
														
	ЗаписьЖурналаРегистрации(НСтр("ru = 'АСУСО. Обмен данными с веб-сервисом AsusoExchange'"),
	УровеньЖурналаРегистрации.Информация, , , ТекстЖурналаПриПодключении);

	РегистрационныйНомер = РегистрыСведений.СообщенияВТехническуюПоддержку.ПолучениеРегНомераКлиента();
	
    Сервис = РегистрыСведений.СообщенияВТехническуюПоддержку.ПолучитьСервисAsusoExchange();

	Попытка
		Если ТолькоИзмененные Тогда
			ДанныеАСУСО = Сервис.ПолучитьИзмененные(РегистрационныйНомер, СтрокаСоединенияИнформационнойБазы());
			Если ДанныеАСУСО = "false" Тогда
				ЗаписьЖурналаРегистрации(НСтр("ru = 'АСУСО. Обмен данными с веб-сервисом AsusoExchange'"),
				УровеньЖурналаРегистрации.Предупреждение, , ,
				НСтр("ru = 'Текущая база данных не зарегистрирована для обмена измененениями. Необходимо сообщить разработчику'"));
				Возврат;
			КонецЕсли;
		Иначе
			ДанныеАСУСО = Сервис.ПолучитьОтчет(РегистрационныйНомер);
		КонецЕсли; 
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'АСУСО. Обмен данными с веб-сервисом AsusoExchange'"),
		УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	ЗаписьЖурналаРегистрации(НСтр("ru = 'АСУСО. Обмен данными с веб-сервисом AsusoExchange'"),
		УровеньЖурналаРегистрации.Информация, , ,
		СтрШаблон(НСтр("ru = 'Данные получены. Количество: %1. Идет запись в регистры'"), ДанныеАСУСО.Сообщение.Количество()));

	КэшПользователей = Новый Соответствие;
	
	Для Каждого ДанныеСообщения Из ДанныеАСУСО.Сообщение Цикл
		
		НаборЗаписей = РегистрыСведений.СообщенияВТехническуюПоддержку.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Идентификатор.Установить(ДанныеСообщения.Идентификатор);
		НаборЗаписей.Прочитать();
		
		//определяем ВидСообщения
		ВидСообщения = ДанныеСообщения.ДанныеКлиента.Вид;
		Если ВидСообщения = "Ошибка" Тогда
			ВидСообщения = Перечисления.ВидыСообщенийВТехническуюПоддержку.Ошибка;
		ИначеЕсли ВидСообщения = "Доработка" Тогда
			ВидСообщения = Перечисления.ВидыСообщенийВТехническуюПоддержку.Доработка;
		ИначеЕсли ВидСообщения = "Консультация" Тогда
			ВидСообщения = Перечисления.ВидыСообщенийВТехническуюПоддержку.Консультация;
		ИначеЕсли ВидСообщения = "Прочее" Тогда
			ВидСообщения = Перечисления.ВидыСообщенийВТехническуюПоддержку.Прочее;
		Иначе 
			ВидРазработчика = ДанныеСообщения.ВидРазработчика;
			Если ВидРазработчика = "Ошибка" Тогда
				ВидСообщения = Перечисления.ВидыСообщенийВТехническуюПоддержку.Ошибка;
			ИначеЕсли ВидРазработчика = "Доработка" Тогда
				ВидСообщения = Перечисления.ВидыСообщенийВТехническуюПоддержку.Доработка;
			ИначеЕсли ВидРазработчика = "Консультация" Тогда
				ВидСообщения = Перечисления.ВидыСообщенийВТехническуюПоддержку.Консультация;
			Иначе
				ВидСообщения = Перечисления.ВидыСообщенийВТехническуюПоддержку.Прочее;
			КонецЕсли;
		КонецЕсли;
		
		//Заполняем ответственного			
		Отправитель = ПолучитьОтправителя(КэшПользователей, ДанныеСообщения.ДанныеКлиента.Пользователь);
		
		// разобраться со статусом который просто "Статус"
		// остальное пишем как есть без проблем особых
		Если НаборЗаписей.Количество() > 0 Тогда
			ТекущаяЗапись = НаборЗаписей[0];
			ТекущаяЗапись.Отправитель		= Отправитель;
		Иначе
			ТекущаяЗапись = НаборЗаписей.Добавить();
			ТекущаяЗапись.Идентификатор		= ДанныеСообщения.Идентификатор;
			ТекущаяЗапись.Важность			= ДанныеСообщения.ДанныеКлиента.Важность;
			ТекущаяЗапись.Вид				= ВидСообщения;
			ТекущаяЗапись.ДатаОтправки		= ДанныеСообщения.ДанныеКлиента.ДатаОтправки;
			ТекущаяЗапись.ДатаСогласования	= ТекущаяЗапись.ДатаОтправки;
			ТекущаяЗапись.ДатаСоздания		= ТекущаяЗапись.ДатаОтправки;
			ТекущаяЗапись.Согласовано		= Истина;
			ТекущаяЗапись.Текст				= ДанныеСообщения.ДанныеКлиента.Текст;
			ТекущаяЗапись.Файлы				= Новый ХранилищеЗначения(Новый Массив);
			ТекущаяЗапись.Отправитель		= Отправитель;
		КонецЕсли;
		
		ТекущаяЗапись.Раздел				= ДанныеСообщения.Раздел;
		ТекущаяЗапись.КодРазработчика		= ДанныеСообщения.КодРазработчика;
		ТекущаяЗапись.ЗаданиеНаРазработку	= ДанныеСообщения.ЗаданиеНаРазработку;
		ТекущаяЗапись.ВидРазработчика		= ДанныеСообщения.ВидРазработчика;
		ТекущаяЗапись.СтатусРазработчика	= ДанныеСообщения.СтатусРазработчика;
		ТекущаяЗапись.НомерРелиза			= ДанныеСообщения.НомерРелиза;
		ТекущаяЗапись.ДатаВыполнения		= ДанныеСообщения.ДатаВыполнения;
		ТекущаяЗапись.СвязанноеСообщение	= ДанныеСообщения.РодительИдентификатор;
		ТекущаяЗапись.Важность				= ДанныеСообщения.ДанныеКлиента.Важность;
		// 03.09.2012, Ишкаев В.М., п.2052, НАЧАЛО
		ТекущаяЗапись.ВидИсполнителя		= ДанныеСообщения.ДанныеКлиента.Вид;
		ТекущаяЗапись.Тема					= ДанныеСообщения.ДанныеКлиента.Тема;
		// 03.09.2012, Ишкаев В.М., п.2052, КОНЕЦ
		
		// заменим комментарии
		ТаблицаКомментариев = РегистрыСведений.СообщенияВТехническуюПоддержку.ПолучитьШаблонТаблицыКомментариев();
		
		Для Каждого ДанныеКомментария Из ДанныеСообщения.Комментарии.Комментарий Цикл
			СтрокаКомментария = ТаблицаКомментариев.Добавить();
			СтрокаКомментария.АвторТип				= ДанныеКомментария.Пользователь.Тип;
			СтрокаКомментария.АвторИдентификатор	= ДанныеКомментария.Пользователь.Идентификатор;
			СтрокаКомментария.АвторИмя				= ДанныеКомментария.Пользователь.Имя;
			СтрокаКомментария.АвторПолноеИмя		= ДанныеКомментария.Пользователь.ПолноеИмя;
			СтрокаКомментария.Код					= ДанныеКомментария.Код;
			СтрокаКомментария.Идентификатор			= ДанныеКомментария.Идентификатор;
			СтрокаКомментария.Период				= ДанныеКомментария.Период;
			СтрокаКомментария.Текст					= ДанныеКомментария.Текст;
			СтрокаКомментария.РодительИдентификатор	= ДанныеКомментария.РодительИдентификатор;
			СтрокаКомментария.РодительКод			= ДанныеКомментария.РодительКод;
			
			СтрокаКомментария.Рейтинг = ?(ЗначениеЗаполнено(СтрокаКомментария.РодительИдентификатор), 2, 1);
		КонецЦикла;
	
		ТекущаяЗапись.Комментарии = Новый ХранилищеЗначения(ТаблицаКомментариев, Новый СжатиеДанных(9));
		
		Для Каждого ДанныеОписания Из ДанныеСообщения.ОписанияИзменений.Описание Цикл
			
			ТекущаяЗапись.ОписаниеИзменений		= ДанныеОписания.Текст;
			
		КонецЦикла;
		//Запись сообщения в регистр Сообщения в тех.поддержку
		НаборЗаписей.Записать();
		
		//Чтение пакета объектов и запись в регистр История изменения объектов
		НаборЗаписейОбъекты = РегистрыСведений.ИсторияИзмененияОбъектов.СоздатьНаборЗаписей();
		
		Для Каждого СтрокаОбъека Из ДанныеСообщения.Объекты.Объект Цикл
			НаборЗаписейОбъекты.Отбор.ИдентификаторСообщения.Установить(СтрокаОбъека.РодительИдентификатор);
			НаборЗаписейОбъекты.Отбор.ПолноеИмяОбъекта.Установить(СтрокаОбъека.ПолноеИмя);
			НаборЗаписейОбъекты.Прочитать();
			
			Если НаборЗаписейОбъекты.Количество() > 0 Тогда
				ТекущаяЗапись = НаборЗаписей[0];
			Иначе
				ТекущаяЗапись = НаборЗаписейОбъекты.Добавить();
				ТекущаяЗапись.ИдентификаторСообщения  = СтрокаОбъека.РодительИдентификатор;
				ТекущаяЗапись.ПолноеИмяОбъекта  = СтрокаОбъека.ПолноеИмя;
				ТекущаяЗапись.НомерКартинки  = СтрокаОбъека.НомерКартинки;
				ТекущаяЗапись.РелизКонфигурации  = ДанныеСообщения.НомерРелиза;
				НаборЗаписейОбъекты.Записать();
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'АСУСО. Обмен данными с веб-сервисом AsusoExchange'"),
	УровеньЖурналаРегистрации.Информация, , ,
	НСтр("ru = 'Запись данных в регистр завершена'"));

	Если ТолькоИзмененные Тогда
		Если ДанныеАСУСО.Сообщение.Количество() > 0 Тогда
			РегистрыСведений.СообщенияВТехническуюПоддержку.ОтправитьОтветНаВебСервер(РегистрационныйНомер);
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

Функция ПолучитьОтправителя(КэшПользователей, ДанныеПользователя)

	// Поиск по в кэше	
    НайденноеЗначение = КэшПользователей.Получить(ДанныеПользователя.Идентификатор);
	
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(НайденноеЗначение) И ОбщегоНазначения.СсылкаСуществует(НайденноеЗначение) Тогда
		Возврат НайденноеЗначение;
	КонецЕсли;

	МенеджерОбъекта = Справочники.Пользователи;
	
	// Поиск по идентификатору                 	
	Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ДанныеПользователя.Идентификатор) Тогда
		УИДЭлемента = Новый УникальныйИдентификатор(ДанныеПользователя.Идентификатор);
		НайденноеЗначение = МенеджерОбъекта.ПолучитьСсылку(УИДЭлемента);
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(НайденноеЗначение) И ОбщегоНазначения.СсылкаСуществует(НайденноеЗначение) Тогда
		КэшПользователей.Вставить(ДанныеПользователя.Идентификатор, НайденноеЗначение);
		Возврат НайденноеЗначение;
	КонецЕсли;
	
	// Поиск по полному имени
	Если ЗначениеЗаполнено(ДанныеПользователя.ПолноеИмя) Тогда
		НайденноеЗначение = МенеджерОбъекта.НайтиПоНаименованию(ДанныеПользователя.ПолноеИмя);
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(НайденноеЗначение) И ОбщегоНазначения.СсылкаСуществует(НайденноеЗначение) Тогда
		Возврат НайденноеЗначение;
	КонецЕсли;
	
	// Поиск по имени
	Если ЗначениеЗаполнено(ДанныеПользователя.Имя) Тогда
		НайденноеЗначение = МенеджерОбъекта.НайтиПоНаименованию(ДанныеПользователя.Имя);
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(НайденноеЗначение) И ОбщегоНазначения.СсылкаСуществует(НайденноеЗначение) Тогда
		Возврат НайденноеЗначение;
	КонецЕсли;
	
	Возврат Справочники.Пользователи.НайтиПоНаименованию("ПТБ");
		
КонецФункции
